src/config/Documents/ЗакрытиеЗаказовПоРезервуНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ЗакрытиеЗаказовПоРезервуНаСкладах</Name>
			<Comment>(Общ) Закрытие заказов по резерву на складах</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗакрытиеЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/РезервНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РезервНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Documents/ЗакрытиеЗаказовПоРезервуНаСкладах/Ext/ObjectModule.bsl
Процедура ЗаполнитьЗаказыПоОстаткам(ДатаОст='00010101') Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РезервНаСкладахОстатки.ЗаказПокупателя,
	               |	СУММА(РезервНаСкладахОстатки.КоличествоКонечныйОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.РезервНаСкладах.ОстаткиИОбороты( ,//&Дата
				   |, Регистратор, , ) КАК РезервНаСкладахОстатки
	               |ГДЕ
	               |	РезервНаСкладахОстатки.КоличествоКонечныйОстаток > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РезервНаСкладахОстатки.ЗаказПокупателя";
	Если ДатаОст<>'00010101' тогда
		Запрос.Текст = стрЗаменить(Запрос.Текст, "//&Дата", "&Дата");
		Запрос.УстановитьПараметр("Дата", ДатаОст);
 	КонецЕсли;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Заказы.Очистить();
	Пока Выборка.Следующий() Цикл
	  стр1 = Заказы.Добавить();
	  стр1.ЗаказПокупателя = выборка.ЗаказПокупателя;
	  стр1.Количество	   = выборка.Количество;
	КонецЦикла;
	
КонецПроцедуры	

Функция ПодготовитьТаблицуПоРезервамНаСкладахУпр()
СписокЗаказов = Заказы.ВыгрузитьКолонку("ЗаказПокупателя");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка",            Ссылка);
	Запрос.УстановитьПараметр("МоментДокумента",           дата);
	Запрос.УстановитьПараметр("СписокЗаказов",             СписокЗаказов);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РезервНаСкладахОстатки.ЗаказПокупателя,
	               |	РезервНаСкладахОстатки.Номенклатура,
	               |	РезервНаСкладахОстатки.Склад,
	               |	РезервНаСкладахОстатки.АдресХранения,
	               |	РезервНаСкладахОстатки.КоличествоОстаток КАК Количество,
	               |	&ДокументСсылка КАК Регистратор,
	               |	&МоментДокумента КАК Период
	               |ИЗ
	               |	РегистрНакопления.РезервНаСкладах.Остатки(, ЗаказПокупателя В (&СписокЗаказов)) КАК РезервНаСкладахОстатки";
				   
				   
	 ТаблицаРезервов = Запрос.Выполнить().Выгрузить();

	 Возврат ТаблицаРезервов;
	
КонецФункции	

процедура ОбработкаПроведения(Отказ)
	
Если не Отказ тогда
 таблица1 = ПодготовитьТаблицуПоРезервамНаСкладахУпр();	
	набор = регистрыНакопления.РезервНаСкладах.СоздатьНаборЗаписей();
	набор.Отбор.регистратор.ВидСравнения = видСравнения.Равно;
	набор.Отбор.регистратор.Значение = ссылка;
	набор.Отбор.регистратор.использование = истина;
	набор.Прочитать();
	
	Попытка
		НаборДвижений = движения.РезервНаСкладах;
		НаборДвижений.мТаблицаДвижений = Таблица1;
		НаборДвижений.мПериод = Дата;
		
		НаборДвижений.ВыполнитьРасход();

	Исключение
		СообщитьОбОшибке("Не удалось провести документ : "+ОписаниеОшибки() );
	КонецПопытки;
	
КонецЕсли;	
	
КонецПроцедуры
